In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('salaries_by_college_major.csv')

#### This will show us the first 5 rows of our dataframe.

In [3]:
df.head()

,Undergraduate Major,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
0,Accounting,46000.0,77100.0,42200.0,152000.0,Business
1,Aerospace Engineering,57700.0,101000.0,64300.0,161000.0,STEM
2,Agriculture,42600.0,71900.0,36300.0,150000.0,Business
3,Anthropology,36800.0,61500.0,33800.0,138000.0,HASS
4,Architecture,41600.0,76800.0,50600.0,136000.0,Business

### Let's see if we can answer the following questions: 
* **How many rows does our dataframe have?** 

* **How many columns does it have?** 

* **What are the labels for the columns? Do the columns have names?**

* **Are there any missing values in our dataframe? Does our dataframe contain any bad data?**

#### To see the number of rows and columns we can use the shape attribute: ".shape"

In [4]:
df.shape

(51, 6)

#### We can access the column names directly with the 'columns' attribute.

In [5]:
df.columns

Index(['Undergraduate Major', 'Starting Median Salary',
       'Mid-Career Median Salary', 'Mid-Career 10th Percentile Salary',
       'Mid-Career 90th Percentile Salary', 'Group'],
      dtype='object')

### Missing Values and Junk Data
**Before we can proceed with our analysis we should try and figure out if there are any missing or junk data in our dataframe. That way we can avoid problems later on. In this case, we're going to look for NaN (Not A Number) values in our dataframe. NAN values are blank cells or cells that contain strings instead of numbers. Use the .isna() method and see if you can spot if there's a problem somewhere.**

In [ ]:
df.isna()

##### Check the last couple of rows in the dataframe:

In [9]:
df.tail()

,Undergraduate Major,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
46,Psychology,35900.0,60400.0,31600.0,127000.0,HASS
47,Religion,34100.0,52000.0,29700.0,96400.0,HASS
48,Sociology,36500.0,58200.0,30700.0,118000.0,HASS
49,Spanish,34000.0,53100.0,31000.0,96400.0,HASS
50,Source: PayScale Inc.,NaN,NaN,NaN,NaN,NaN

In [10]:
# Delete the Last Row
clean_df = df.dropna()
clean_df.tail()

,Undergraduate Major,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
45,Political Science,40800.0,78200.0,41200.0,168000.0,HASS
46,Psychology,35900.0,60400.0,31600.0,127000.0,HASS
47,Religion,34100.0,52000.0,29700.0,96400.0,HASS
48,Sociology,36500.0,58200.0,30700.0,118000.0,HASS
49,Spanish,34000.0,53100.0,31000.0,96400.0,HASS

In [12]:
# To access a particular column from a data frame we can use the square bracket notation, like so:

In [13]:
clean_df['Starting Median Salary']

0     46000.0
1     57700.0
2     42600.0
3     36800.0
4     41600.0
5     35800.0
6     38800.0
7     43000.0
8     63200.0
9     42600.0
10    53900.0
11    38100.0
12    61400.0
13    55900.0
14    53700.0
15    35000.0
16    35900.0
17    50100.0
18    34900.0
19    60900.0
20    38000.0
21    37900.0
22    47900.0
23    39100.0
24    41200.0
25    43500.0
26    35700.0
27    38800.0
28    39200.0
29    37800.0
30    57700.0
31    49100.0
32    36100.0
33    40900.0
34    35600.0
35    49200.0
36    40800.0
37    45400.0
38    57900.0
39    35900.0
40    54200.0
41    39900.0
42    39900.0
43    74300.0
44    50300.0
45    40800.0
46    35900.0
47    34100.0
48    36500.0
49    34000.0
Name: Starting Median Salary, dtype: float64

In [15]:
# To find the highest starting salary we can simply chain the .max() method.
clean_df['Starting Median Salary'].max()

74300.0

In [17]:
# the .idxmax() method will give us index for the row with the largest value.
clean_df['Starting Median Salary'].idxmax()

43

In [24]:
# To see the name of the major that corresponds to that particular row, we can use the .loc (location) property.
clean_df['Undergraduate Major'].loc[43]

'Physician Assistant'

In [25]:
#Here we are selecting both a column ('Undergraduate Major') and a row at index 43, 
#so we are retrieving the value of a particular cell. You might see people using the double square brackets notation to achieve exactly the same thing: 

clean_df['Undergraduate Major'][43]

'Physician Assistant'

In [87]:
#If you don't specify a particular column you can use the .loc property to retrieve an entire row:

clean_df.loc[43]

Undergraduate Major                  Physician Assistant
Starting Median Salary                           74300.0
Mid-Career Median Salary                         91700.0
Mid-Career 10th Percentile Salary                66400.0
Mid-Career 90th Percentile Salary               124000.0
Group                                               STEM
Name: 43, dtype: object

## Question 1:
#### a) What college major has the highest mid-career salary?
#### b) How much do graduates with this major earn? (Mid-career is defined as having 10+ years of experience).

In [58]:
# a) What college major has the highest mid-career salary?
# The Highest Mid-Career Salary

clean_df["Mid-Career Median Salary"].max()
find_index = clean_df['Mid-Career Median Salary'].idxmax()
find_major =clean_df['Undergraduate Major'].loc[8]
find_salary = clean_df['Mid-Career Median Salary'][8]
print(f"The index is: {find_index}\nThe major is :{find_major}\nThe salary of {find_major} is: {find_salary} $")

The index is: 8
The major is :Chemical Engineering
The salary of Chemical Engineering is: 107000.0 $

##### b) How much do graduates with this major earn? (Mid-career is defined as having 10+ years of experience).¶

In [86]:
#Which college major has the lowest starting salary and how much do graduates earn after university?
find_salary = clean_df['Starting Median Salary'].min()
find_index = clean_df['Starting Median Salary'].idxmin()
find_major = clean_df['Undergraduate Major'].loc[49]
print(f"The index is: {find_index}\nThe major is :{find_major}\nThe salary of {find_major} is: {find_salary} $")

The index is: 49
The major is :Spanish
The salary of Spanish is: 34000.0 $

In [97]:
clean_df.loc[clean_df['Mid-Career Median Salary'].idxmin()]

Undergraduate Major                  Education
Starting Median Salary                 34900.0
Mid-Career Median Salary               52000.0
Mid-Career 10th Percentile Salary      29300.0
Mid-Career 90th Percentile Salary     102000.0
Group                                     HASS
Name: 18, dtype: object

### Sorting Values & Adding Columns: Majors with the Most Potential vs Lowest Risk
A low-risk major is a degree where there is a small difference between the lowest and highest salaries. In other words, if the difference between the 10th percentile and the 90th percentile earnings of your major is small, then you can be more certain about your salary after you graduate.

In [109]:
# Alternatively, you can also use the .subtract() method.
# clean_df['Mid-Career 90th Percentile Salary'].subtract(clean_df['Mid-Career 10th Percentile Salary'])

#How would we calculate the difference between the earnings of the 10th and 90th percentile?
spread_col = clean_df['Mid-Career 90th Percentile Salary'] - clean_df['Mid-Career 10th Percentile Salary']
clean_df.insert(1, 'Spread', spread_col)
clean_df.head()

,Undergraduate Major,Spread,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
0,Accounting,109800.0,46000.0,77100.0,42200.0,152000.0,Business
1,Aerospace Engineering,96700.0,57700.0,101000.0,64300.0,161000.0,STEM
2,Agriculture,113700.0,42600.0,71900.0,36300.0,150000.0,Business
3,Anthropology,104200.0,36800.0,61500.0,33800.0,138000.0,HASS
4,Architecture,85400.0,41600.0,76800.0,50600.0,136000.0,Business

### Sorting by the Lowest Spread
<p><strong>To see which degrees have the smallest spread, we can use the .sort_values() method. 
 And since we are interested in only seeing the name of the degree and the major, we can pass a list of these two column names to look at the .head() of these two columns exclusively.</strong></p>

In [120]:
low_risk = clean_df.sort_values('Spread')
low_risk[['Undergraduate Major', 'Spread']].head()

           Undergraduate Major   Spread
40                     Nursing  50700.0
43         Physician Assistant  57600.0
41                   Nutrition  65300.0
49                     Spanish  65400.0
27  Health Care Administration  66400.0

**Using the .sort_values() method, can you find the degrees with the highest potential?** 
**Find the top 5 degrees with the highest values in the 90th percentile.**

In [122]:
highest_potentiall = clean_df['Mid-Career 90th Percentile Salary'].sort_values(ascending=False)

In [123]:
highest_potential[['Undergraduate Major', 'Mid-Career 90th Percentile Salary']].head()

     Undergraduate Major  Mid-Career 90th Percentile Salary
17             Economics                           210000.0
22               Finance                           195000.0
8   Chemical Engineering                           194000.0
37                  Math                           183000.0
44               Physics                           178000.0

**Find the top 5 degrees with the highest values in the 90th percentile.**

In [131]:
highest_spread = clean_df.sort_values('Spread', ascending=False)
highest_spread[['Undergraduate Major', 'Spread']].head()

   Undergraduate Major    Spread
17           Economics  159400.0
22             Finance  147800.0
37                Math  137800.0
36           Marketing  132900.0
42          Philosophy  132500.0

**find the degrees with the greatest spread in salaries. Which majors have the largest difference between high and low earners after graduation.**

In [137]:
highest_spread = clean_df.sort_values('Mid-Career Median Salary', ascending=False)
highest_spread[['Undergraduate Major', 'Spread']].head()

       Undergraduate Major    Spread
8     Chemical Engineering  122100.0
12    Computer Engineering   95900.0
19  Electrical Engineering   98700.0
1    Aerospace Engineering   96700.0
17               Economics  159400.0

### Grouping and Pivoting Data with Pandas

In [140]:
clean_df.groupby('Group').count()

,Undergraduate Major,Spread,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary
Group,,,,,,
Business,12,12,12,12,12,12
HASS,22,22,22,22,22,22
STEM,16,16,16,16,16,16

In [144]:
# Mini Challenge
# Now can you use the .mean() method to find the average salary by group?
clean_df.groupby('Group').mean()

,Spread,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary
Group,,,,,
Business,103958.333333,44633.333333,75083.333333,43566.666667,147525.000000
HASS,95218.181818,37186.363636,62968.181818,34145.454545,129363.636364
STEM,101600.000000,53862.500000,90812.500000,56025.000000,157625.000000

In [145]:
pd.options.display.float_format = '{:,.2f}'.format 
clean_df.groupby('Group').mean()

,Spread,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary
Group,,,,,
Business,"103,958.33","44,633.33","75,083.33","43,566.67","147,525.00"
HASS,"95,218.18","37,186.36","62,968.18","34,145.45","129,363.64"
STEM,"101,600.00","53,862.50","90,812.50","56,025.00","157,625.00"